In [1]:
import matplotlib
import numpy as np
import pandas as pd
%matplotlib inline

In [83]:
input_df = pd.read_json('./input/input.txt')

In [84]:
input_df.fillna("", inplace=True)

In [88]:
input_df.head()

,adr_city,adr_state,camera_make,customer_id,event_time,key,last_name,total_amount,type,verb,total_amount_in_dollars
0,,,,06e6eef6adf2,2017-06-02 23:33:54,06e6eef6adf2,,,SITE_VISIT,NEW,NaN
1,,,,7bdeecc97cf8,2017-06-06 06:30:09,7bdeecc97cf8,,2233 USD,ORDER,UPDATE,2233.0
2,Lockhaven,MD,,,2017-06-01 06:53:52,7bdeecc97cf8,Peter,,CUSTOMER,NEW,NaN
3,Portland,,,,2017-06-01 20:25:11,a1881c06eec9,Peter,,CUSTOMER,NEW,NaN
4,,,,06e6eef6adf2,2017-06-02 01:44:28,06e6eef6adf2,,,SITE_VISIT,NEW,NaN

In [92]:
input_df['total_amount_in_dollars'] = pd.to_numeric(input_df['total_amount'].apply(lambda x: x.replace(" USD","")))

In [87]:
input_df.groupby('customer_id').agg({'total_amount_in_dollars': np.sum,}).sort('total_amount_in_dollars')

              total_amount_in_dollars
customer_id
                                  NaN
06e6eef6adf2                  20337.0
0b7f849446d3                  23892.0
312a46dc5211                   2535.0
7bdeecc97cf8                   6914.0
7d112681b8dd                  23992.0
86f284342106                  11019.0
a14c955bda57                  11718.0
a1881c06eec9                  33952.0
b3daa77b4c04                  18468.0

In [58]:
input_df['total_amount_in_dollars'].apply(lambda x: float(x))

0
1     2233
2
3
4
5
6     1011
7
8
9
10
11
12
13    4626
14
15    8737
16
17
18    2056
19
20    1680
21
22
23    6081
24    4717
25
26
27
28
29    8249
      ...
70
71
72
73
74
75    2535
76
77    6129
78
79
80
81
82
83    4086
84    2554
85
86
87
88    6978
89
90    6829
91    8004
92
93
94    9089
95
96
97      54
98
99
Name: total_amount_in_dollars, Length: 100, dtype: object

In [93]:
input_df[input_df.type == 'ORDER'].count()

adr_city                   32
adr_state                  32
camera_make                32
customer_id                32
event_time                 32
key                        32
last_name                  32
total_amount               32
type                       32
verb                       32
total_amount_in_dollars    32
dtype: int64

In [98]:
input_df.groupby('customer_id').agg({input_df[input_df.type == 'ORDER']: np.sum})

TypeError: 'DataFrame' objects are mutable, thus they cannot be hashed